app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    id = params[:id]
    @movie = Movie.find(id)

INSERT INTO "movies" ("created_at", "description", "director", "rating", "release_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    if params['commit'] != "Cancel"
      @movie = Movie.create!(params[:movie])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "director" = 'Ridley Scott', "rating" = 'G', "description" = '', "updated_at" = '2012-11-09 17:24:29.055069' WHERE "movies"."id" = 3
---
  def update
    if params['commit'] != "Cancel"
      @movie = Movie.find params[:id]
      @movie.update_attributes!(params[:movie])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'Robin'
---
  def similar
    @movie = Movie.find(params[:id])
    if @movie
      if @movie.director != nil
        if @movie.director.length > 0