app/controllers/sessions_controller.rb

SELECT "moviegoers".* FROM "moviegoers" WHERE "moviegoers"."provider" = 'twitter' AND "moviegoers"."uid" = '123545' LIMIT 1
---
  def create
    auth = request.env["omniauth.auth"]
    user = Moviegoer.find_by_provider_and_uid(auth["provider"], auth["uid"]) || Moviegoer.create_with_omniauth(auth)